"""20.Дано ціле число, яке лежить в діапазоні 1-999.
Вивести його рядок-опис виду «парне двозначне
число», «непарне тризначне число» і т. Д."""

x = int(input('Введите число в радиусе от 1 до 999: '))
if x % 2 == 0:
    print('Ваше число парне')
else:
    print('Ваше число непарне ')
print('Ваш число состоит из ', (len(str(x))), 'цифр')
