#
# Глущук Андрій 141
# Лабораторна робота №1
# 5. Обчислити дробову частину середнього геометричного трьох заданих позитивних чисел.
#

a = int(input("Вкажіть число А: "))
b = int(input("Вкажіть число B: "))
c = int(input("Вкажіть число C: "))

if a > 0 and b > 0 and c > 0:   # Перевірка трьох чисел на позитивність (за умовою)
    geometricmean = (a * b * c) ** (1/3)
    print("Середнє геометричне: ", geometricmean)
    print("Дробова частина середнього геометричного: ", (geometricmean - int(geometricmean)))
else:
    print("Введене число не є позитивним.")