""" 10. Дано ціле число N (> 0). Знайти значення виразу 1.1 - 1.2 + 1.3 - ... (N доданків, знаки
чергуються). Умовний оператор не використовувати. """

N = float(input("Введите число: "))
s = 0
a = 1
b = -1
while N > 0:
    a = a + 0.1
    b = -b
    s = s + a * b
    N = N - 1
print(round(s, 1))
