"""12.Дано чотири цілих числа, одне з яких відмінно від трьох інших, рівних між собою. Вивести
порядковий номер цього числа."""
x1 = int(input('Введите 1-е число: '))
x2 = int(input('Введиет 2-е число: '))
x3 = int(input('Введиет 3-е число: '))
x4 = int(input('Введиет 4-е число: '))
if x1 != x2:
    print('Неправильное число или 1-е или 2-е')
    if x1 == x3:
        print('Неправильное число или  2-е')
    else:
        print('Неправильное число или  1-е')

elif x3 != x4:
    print('Неправильное  число или 3-е или 4-е')
    if x3 == x1:
        print('Неправильное число или  4-е')
    else:
        print('Неправильное число или  3-е')
