"""
     Глущук Андрій 141
     Лабораторна робота №4
     Завдання 1
 1. Дано рядок. Вивести окремі слова, що входять до нього, розділені пробілами, впорядкованими за
алфавітом, в стовпчик.
"""


S = input("Enter string: ")
words = S.split()
words.sort()

for word in words:
    print(word)
