'''
 Глущук Андрій 141
 Лабораторна робота №2
    13. За довжинами трьох відрізків, введених користувачем, визначити можливість існування
    трикутника, складеного з цих відрізків. Якщо такий трикутник існує, то визначити, чи є він
    різнобічним, рівнобедреним або рівностороннім.
'''

a = float(input("Enter A: "))
b = float(input("Enter B: "))
c = float(input("Enter C: "))

if (a + b) > c or (b + c) > a or (a + c) > b:
    print("Трикутник існує, він ", end='')
    if a == b and b == c:
        print("рівносторонній.")
    elif a == b or b == c or a == c:
        print("рівнобедрений.")
    else:
        print("різнобічний.")
else:
    print("Трикутника не існує.")