'''
Глущук Андрій 141
Лабораторна робота №2
    5. Дано ціле число. Вивести його рядок-опис виду «від'ємне парне число», «нульове число», «додатне
    непарне число» і т. д.
'''

x = int(input("Введіть ціле число: "))

if x == 0:
    print("Нульове число.")

elif x > 0 and (x % 2) == 0:
    print("Число додатнє, парне.")
elif x > 0 and (x % 2):
    print("Число додатнє, непарне.")

elif x < 0 and (x % 2) == 0:
    print("Число від'ємне, парне.")
elif x < 0 and (x % 2):
    print("Число від'ємне, непарне.")