"""Описати функцію DigitN (K, N) цілого типу, яка повертає N-у цифру цілого
позитивного числа K (цифри в числі нумеруються справа наліво). Якщо
кількість цифр в числі K менше N, то функція повертає -1. Для кожного з п'яти
даних цілих позитивних чисел K1, K2, ..., K5 викликати функцію DigitN з
параметром N, що змінюються від 1 до 5."""


def Digitn(k, n):
    if n > k:
        print(-1)
    if n < k:
        c = str(k)
        print(c[n])


n = int
k = int
for n in range(0, 5):
    k = int(input(""))
    Digitn(k, n)
