"""Словник school містить дані про кількість учнів у десяти різних класах
(наприклад, 1а, 1б, 2б, 6а, 7в і т.д.). Дізнайтеся скільки людей в якомусь класі. Уявіть,
що в школі відбулися зміни, внесіть їх до словника: 1) у класі змінилася кількість учнів;
2) у школі з'явилося два нових класи; 3) у школі розформували один з класів. Виведіть
вміст словника на екран.
"""
school = {
    '1a': 38,
    '2a': 27,
    '2b': 32,
    '3a': 33,
    '3b': 22,
    '4a': 19,
    '5a': 29,
    '7a': 26,
    '9b': 36,
    '10a': 18,
}
school['6a'] = 25  # у школі з'явилося два нових класи

school['8b'] = 'Кількість учнів = 23'  # у школі з'явилося два нових класи

del school['3b']  # у школі розформували один з класів
school['4a'] = 'Кількість учнів = 26'  # у класі змінилася кількість учнів;

for k, v in school.items():
    print(f'в классе {k} , {v} учнів ')

print(school)
