"""
1. Дана сторона квадрата a. Знайти його периметр P=4·a.
"""

a = float(input('Side of the square: '))
P = 4 * a
print('Perimeter = ', P)
