"""Лабораторная работа 7
Толочный Виталий 141
Задача 2
Описати рекурсивну функцію Fact2 (N) дійсного типу, яка обчислює значення
подвійного факторіала
N !! = N · (N-2) · (N-4) · ...0
(N> 0 - параметр цілого типу; останній співмножник в добутку дорівнює 2, якщо
N - парне число, і 1, якщо N - непарне). За допомогою цієї функції обчислити
подвійні факторіали п'яти даних чисел."""

def Fact2(N):
    if N > 2:
        return N * Fact2(N - 2)
    else:
        return N
    
for i in range(0,5):    
    print(Fact2(float(input("Введите число: "))))
