'''Лабораторная работа 6
Толочный Виталий
Розробіть функції для здійснення наступних операцій зі списками:
Описати функцію DigitCountSum (K, C, S), що знаходить кількість C цифр цілого
позитивного числа K, а також їх суму S (K - вхідний, C і S - вихідні параметри
цілого типу). За допомогою цієї функції знайти кількість і суму цифр для кожного
з п'яти даних цілих чисел.'''

def DigitCountSum (K):
    l2 = list(str(K))
    C = len(l2)
    S = 0
    for i in l2:
        S+=int(i)
    l3=[]
    l3.append(C)
    l3.append(S)
    return l3

l1 = [int(i) for i in input("Введите 5 целых числа: ").split()]
for i in l1:
    print(DigitCountSum(i))
