'''Лабораторная работа 6
Толочный Виталий 141
Описати функцію RadToDeg (R) дійсного типу, яка знаходить величину кута в
градусах, якщо дана його величина R в радіанах (R - дійсне число, 0 ≤ R <2 · π).
Скористатися таким співвідношенням: 180 ° = π радіанів. Як значення π
вважати рівним 3.14. За допомогою функції RadToDeg перевести з радіанів в
градуси п'ять даних кутів '''

def RadToDeg(R):
    return (R/3.14)*180

l1 = [float(i) for i in input("Введите 5 кутов в радианах: ").split()]
for i in l1:
    print(round(RadToDeg(i),2))








