""" 18. Дано ціле число N (> 0). Використовуючи операції ділення без остачі і взяття залишку від
ділення, вивести всі його цифри, починаючи з самої правої (розряду одиниць). """

N = int(input("Введите число: "))
if N <= 0:
    print("Неверное число")
    a = 0
else:
    while N > 0:
        a = N % 10
        print(a)
        N = N // 10
