'''19. Дано натуральне число. Потрібно визначити, чи є рік з даними номером високосним. Якщо рік є високосним, то виведіть YES, інакше виведіть NO.
Нагадаємо, що відповідно до григоріанським календарем, рік є високосним, якщо його номер кратний 4, але не кратний 100, а також якщо він кратний 400.'''
N = int(input("Введите номер года: "))
if N % 4 == 0 and N % 100 != 0 or N % 400 == 0:
    print("Yes")
else:
    print("No")
