'''7. Одиниці маси пронумеровані в такий спосіб: 1 - кілограм, 2 - міліграм, 3 - грам, 4 - тонна, 5 - центнер.
Дано номер одиниці маси (ціле число в діапазоні 1-5) і маса тіла в цих одиницях (дійсне число). Знайти масу тіла в кілограмах.'''
print("Введите массу и выберите её номер из списка:\n 1 - кілограм, 2 - міліграм, 3 - грам, 4 - тонна, 5 - центнер.\n")
M = int(input("Масса:"))
N = int(input("Номер:"))
if (N == 1):
    print("Вы выбрали массу в килограммах. Мне не во что переводить это число...")
elif (N == 2):
    M2 = M / pow(10, 6)
    print(M, " милиграм = ", M2, "килограмм")
elif (N == 3):
    M2 = M / pow(10, 3)
    print(M, " грам = ", M2, "килограмм")
elif (N == 4):
    M2 = M * pow(10, 3)
    print(M, " тонн = ", M2, "килограмм")
elif (N == 5):
    M2 = M * pow(10, 2)
    print(M, " центнер = ", M2, "килограмм")
