"""16. Дано ціле число, що позначає код символу по таблиці ASCII. Визначити,
це код англійської
літери або будь-якої іншої символ."""
x = int(input('Введите число для проверки: '))
if 65 < x < 90 or 97 < x < 122:
    print('Ваше число из таблицы ASCII и является анлг буквой ')
else:
    print('Ваше число не является анг буквой')
