"""
Дано рядок. Вивести окремі слова, що входять до нього,
розділені пробілами, впорядкованими за алфавітом, в стовпчик.
"""

string = str(input("Введите строку: "))

w = string.split()
e = ""
for r in sorted(w):
    e = e+" " + r
print(*e.split(), sep='\n')
