"""
Задача 4
4. Описати рекурсивну функцію Fib1 (N) цілого типу, яка обчислює N-й елемент
послідовності чисел Фібоначчі (N - ціле число):
F1 = F2 = 1,
FK = FK-2 + FK-1, K = 3, 4, ....'''
За допомогою цієї функції знайти п'ять чисел Фібоначчі з даними номерами, і
вивести ці числа разом з кількістю рекурсивних викликів функції Fib1, що необхідні
для їх знаходження.
"""

C = 0

def Fib1(N):
    global C
    C += 1
    if N > 2:
        return Fib1(N - 2) + Fib1(N - 1)
    return 1

for i in range(0,5):
    print(Fib1(int(input("Введите число: "))))
print(C)
