#
# Глущук Андрій 141
# Лабораторна робота №1
# 17. Швидкість першого автомобіля V1 км/год, другого - V2 км/год, відстань між ними S км.
# Визначити відстань між ними через T годин, якщо автомобілі спочатку рухаються назустріч один
# одному. Дана відстань рівна модулю різниці початкової відстані і загального шляху, пройденого
# автомобілями; загальний шлях = час · сумарна швидкість.
#

V1 = int(input("Швидкість 1-го автомобіля, км/год: "))
V2 = int(input("Швидкість 2-го автомобіля, км/год: "))
S1 = int(input("Початкова відстань між авто, км: "))
T = int(input("Пройдено годин: "))

S = T * (V1 + V2)            # Загальний шлях
print("\nВідстань між авто через ", T, " год: ", (abs(S1-S)), sep = "")

# Ф-ція abs - модуль