"""
     Глущук Андрій 141
     Лабораторна робота №4
     Завдання 5
 17. Дано список A, кількість елементів якого N. Сформувати новий список B того ж розміру за таким
правилом: елемент BK дорівнює середньому арифметичному елементів масиву A з номерами від 1 до к
"""

N = int(input("Enter N:"))
A = list()
B = list()

z = N
while z != 0:
    x = input()
    A.append(int(x))
    z -= 1

i = 1
while i <= N:
    B.append(sum(A[:i]) / i)
    i += 1
print(B)
