#
# Глущук Андрій 141
# Лабораторна робота №1
# 13. Дані координати двох протилежних вершин прямокутника: (x1, y1), (x2, y2). Сторони
# прямокутника паралельні до осів координат. Знайти периметр і площу даного прямокутника.
#

print("   Введіть координати двох протилежних вершин прямокутника")

x1 = int(input("X1: "))
y1 = int(input("Y1: "))
x2 = int(input("X2: "))
y2 = int(input("Y2: "))

P = (abs(x1 - x2) + abs(y1 - y2)) * 2
S = abs(x1 - x2) * abs(y1 - y2)
# Сторона прямокутника = різниці координат протилежних вершин

print("Периметр прямокутника:", P, "\nПлоща прямокутника   :", S)