"""Дано ціле число. Вивести його рядок-опис виду «від'ємне парне число»,
 «нульове число», «додатне непарне число» і т. д."""

number = int(input("Введите целое число:"))

if not (number % 2) and number > 0:
    print("Число положительное, парное")
elif (number % 2) != 0 and number > 0:
    print("Число положительное, непарное")
elif number == 0:
    print("Число нулевое")
elif not (number % 2) and number < 0:
    print("Число отрицательное, парное")
elif (number % 2) != 0 and number < 0:
    print("Число отрицательное, непарное")
else:
    print("Введено неверное значение")