"""
Мастям гральних карт присвоєно порядкові номери: 1 - піки, 2 - трефи, 3 - бубни, 4 - черви.
Вартості карт, які старші за десятку, привласнені номери: 11 - валет, 12 - дама, 13 - король, 14 - туз.
Дано два цілих числа: N - вартість (6 ≤ N ≤ 14) і M - масть карти (1 ≤ M ≤ 4).
Вивести назву відповідної карти виду «шістка бубон», «дама черв», «туз треф», тощо.
"""

N = int(input("Введите стоимось карты(От 6 до 14):"))
M = int(input("Введите масть карты(От 1 до 4):"))

if N == 6:
    a = "Шесть"
elif N == 7:
    a = "Семь"
elif N == 8:
    a = "Восемь"
elif N == 9:
    a = "Девять"
elif N == 10:
    a = "Десять"
elif N == 11:
    a = "Валет"
elif N == 12:
    a = "Дама"
elif N == 13:
    a = "Король"
elif N == 14:
    a = "Туз"

if M == 1:
    b = " Пик"
elif M == 2:
    b = " Треф"
elif M == 3:
    b = " Буба"
elif M == 4:
    b = " Черви"

print(a + b)
