"""
За довжинами трьох відрізків, введених користувачем,
визначити можливість існування трикутника,складеного з цих відрізків.
Якщо такий трикутник існує, то визначити, чи є він різнобічним, рівнобедреним або рівностороннім.
"""

A = float(input("Введите первую сторону треугольника:"))
B = float(input("Введите вторую сторону треугольника:"))
C = float(input("Введите третью сторону треугольника:"))


if A == B or B == C and A != C:
    print("Треугольник равнобедренный")
elif A != B and A != C and B != C:
    print("Треугольник разносторонний")
elif A == B and B == C:
    print("Треугольник равносторонний")
else:
    print(" Такого треугольника не существует ")