"""
Описати рекурсивну функцію RootK (X, K, N) дійсного типу, яка знаходить
наближене значення кореня K-го ступеня з числа X за формулою:
Y0 = 1,
YN + 1 = YN - (YN - X / (YN) K-1) / K,
де YN позначає RootK (X, K, N) при фіксованих X і K. Параметри функції: X (> 0)
- дійсне число, K (> 1) і N (> 0) - цілі. За допомогою функції RootK знайти для
даного числа X наближені значення його кореня K-го степеня при шести даних
значеннях N."""

def RootK(X,K,N):
    if N != 0:
        return RootK(X,K,N - 1) - (RootK(X,K,N - 1) - X /(RootK(X,K,N - 1) ** (K - 1))) / K
    return 1

x = int(input("Введите X: "))
k = int(input("Введите K: "))
l1 = []

for i in range(0,6):
    l1.append(RootK(x,k,int(input("Введите N: "))))
print(l1)