"""
Дано натуральне число. Знайдіть число десятків у його десяткового запису.
"""

n = int(input("Введите число:"))
k = -1

while n != 0:
    n = (n - (n % 10))/10
    k += 1
print("Десятков:" + str(k))
