"""
Дано ціле число N (> 1). Знайти найменше ціле число K, при якому виконується нерівність 3K> N.
"""

N = int(input("Введите число:"))
K = 1

if N <= 1:
    print("Введено неверное значение")
while 3*K <= N:
    K += 1
print("Наименьшее число при котором выполняется неравность (3K > N) будет " + str(K))
