'''
 Глущук Андрій 141
 Лабораторна робота №2
    1. Дано ціле число. Якщо воно є додатним, то відняти від нього 8; в іншому разі не змінювати його.
    Вивести отримане число.
'''

x = int(input("Введіть ціле число: "))

if x > 0:
    print(x - 8)
else:
    print(x)