"""
     Глущук Андрій 141
     Лабораторна робота №6
     Завдання 2
 5. Описати функцію TriangleP (a, h), що знаходить периметр рівнобедреного
трикутника за його основою a і висотою h, проведеною до основи (a і h - дійсні).
За допомогою цієї функції знайти периметри трьох трикутників, для яких дані
основи і висоти. Для знаходження сторони b трикутника використовувати
теорему Піфагора: b
2 = (a / 2) 2 + h2
"""


def triangleP(a, h):
    from math import sqrt
    c = sqrt((a/2)+h)
    return c + (a/2) + h


for i in range(3):
    a = float(input("a: "))
    h = float(input("h: "))
    P = triangleP(a, h)
    print("P = ", P)
