""". Описати програму з використанням словника, у якій зберігаються дані про
товари, їх кількість та ціну."""
Tovaru = {'Олівець':
    {
        'кількіст': 16,
        'ціна': 1,
    },
    'Ручка ':
        {
            'кількість': 29,
            'ціна': 2.50,
        },
    'Зошит в клітинку ':
        {
            'кількість': 40,
            'ціна': 2,
        },
    'Лінійка':
        {
            'кількість': 24,
            'ціна': 7,
        },
    'Зошит у лінію':
        {
            'кількість': 42,
            'ціна': 2,
        },
    'Затирачка':
        {
            'кількість': 15,
            'ціна': 5,
        },
}
