#
# Глущук Андрій 141
# Лабораторна робота №1
# 1. Дана сторона квадрата a. Знайти його периметр P=4·a.
#

P = 4 * (int(input("Введіть сторону квадрата: ")))
print("Периметр квадрата       :" , P)