"""
     Глущук Андрій 141
     Лабораторна робота №3
     Завдання 3
 13. Дано ціле число N (> 0). Знайти квадрат даного числа, використовуючи для його обчислення
 наступну формулу: N2 = 1 + 3 + 5 + ... + (2 • N - 1).
"""


n = int(input("Enter a integer: "))

result = 0
i = 1

if n > 0:
    while i < (2 * n - 1):
        i += 2
        result += i
        print(result + 1)
else:
    print("Error. N > 0")
