"""
     Глущук Андрій 141
     Лабораторна робота №8
     Завдання 4-5
    Описати функції: 1) формування словника; 2) виведення даних зі словника; 3)
внесення змін до словника; 4) пошуку значення у словнику.

5. Словник school містить дані про кількість учнів у десяти різних класах
(наприклад, 1а, 1б, 2б, 6а, 7в і т.д.). Дізнайтеся скільки людей в якомусь класі. Уявіть,
що в школі відбулися зміни, внесіть їх до словника: 1) у класі змінилася кількість учнів;
2) у школі з'явилося два нових класи; 3) у школі розформували один з класів. Виведіть
вміст словника на екран.

1. Описати програму з використанням словника, у якій зберігаються дані про
товари, їх кількість та ціну.

"""


def dict_form():
    keys = input("Введіть ключи словника (розділяючи пробілами): ").split()
    values = input("Введіть значення словника (розділяючи пробілами): ").split()
    temp = dict(zip(keys, values))
    return temp

dct = dict_form()

def dict_out():
    print(dct)

def dict_search():
    print(dct.get(input('Введіть ключ словника, щоб отримати значення: '), 'Словник не знайдено.'))


def dict_change():
    x = None
    while x != '0':
        x = input('\n0 - Вийти з редагування словника\n1 - Змінити/добавити елемент'
                  '\n2 - Видалити елемент словнику\nВведіть № необхідної функції: ')

        if x == '1':
            temp_input = input('Введіть ключ елементу, котрий потрібно змінити/добавити: ')
            dct[temp_input] = input('Введіть значення елементу: ')
        elif x == '2':
            del dct[input('Введіть ключ елементу, котрий потрібно видалити: ')]
        else:
            print('Введено невірний номер функції!')


temp = None
while temp != '0':
    print('\n 1 - Виведення даних зі словника\n 2 - Пошук значення у словнику\n 3 - Внесення змін'
          '\n Щоб завершити роботу програми - введіть "0"!')
    temp = input('Введіть номер функції: ')
    if temp == '1':
        dict_out()
    elif temp == '2':
        dict_search()
    elif temp == '3':
        dict_change()
    else:
        'Введено невірний номер функції!'
