"""
     Глущук Андрій 141
     Лабораторна робота №4
     Завдання 2
 5. Дано рядок. Виведіть третій символ цього рядка, перші п'ять символів цього рядка, всі символи у
зворотному порядку.
"""


S = input("Enter string: ")

print(S[2], S[:5], S[::-1], sep='\n')
