"""6. Дано рядок. Якщо в цьому рядку буква f зустрічається тільки один раз, виведіть її індекс. Якщо
вона зустрічається два і більше разів, виведіть індекс її першого і останнього входження. Якщо
буква f в цьому рядку не зустрічається, нічого не виводьте."""

text = input('Введите текст: ')
first = text.find('f')
last = text.rfind('f')
if first == last:
  print(first)
else:
  print(first)
  print(last)
