"""
Дано рядок, що містить принаймні один символ пробілу.
Вивести підрядок, розташований між першим і останнім пробілом початкового рядка.
Якщо рядок містить тільки один пробіл, то вивести порожний рядок.
"""

string = input(str("Введите строку:"))

print(string[string.find(' '):string.rfind(' ')])
