'''
Глущук Андрій 141
Лабораторна робота №2
    9. Мастям гральних карт присвоєно порядкові номери: 1 - піки, 2 - трефи, 3 - бубни, 4 - черви.
    Вартості карт, які старші за десятку, привласнені номери: 11 - валет, 12 - дама, 13 - король, 14 - туз.
    Дано два цілих числа: N - вартість (6 ≤ N ≤ 14) і M - масть карти (1 ≤ M ≤ 4). Вивести назву
    відповідної карти виду «шістка бубон», «дама черв», «туз треф», тощо.
'''

N = int(input("Введіть вартість карти: "))
M = int(input("Введіть масть карти   : "))

if N >= 6 and N <= 14:
    if N == 6:
        print("Шістка ", end='')
    elif N == 7:
        print("Сімка ", end='')
    elif N == 8:
        print("Вісімка ", end='')
    elif N == 9:
        print("Дев'ятка ", end='')
    elif N == 10:
        print("Десятка ", end='')
    elif N == 11:
        print("Валет ", end='')
    elif N == 12:
        print("Дама ", end='')
    elif N == 13:
        print("Король ", end='')
    elif N == 14:
        print("Туз  ", end='')
else:
    print("Введена вартість невірна.")

if M >= 1 and M <= 4:
    if M == 1:
        print("пік")
    elif M == 2:
        print("треф")
    elif M == 3:
        print("бубон")
    elif M == 4:
        print("черв")
else:
    print("Введена масть невірна.")