""" 14. Дано ціле число N (> 0). Знайти добуток N! = 1 • 2 • ... • N (N-факторіал). Щоб уникнути
цілочисельного переповнення, обчислювати цей добуток за допомогою дійсної змінної і вивести його
як дійсне число. """

N = int(input("Введите число: "))
if N <= 0:
    print("Неверное число")
else:
    k = 1
    product = 1
    while k <= N:
        product = product * k
        k = k + 1
    print(product)
