"""13.За довжинами трьох відрізків, введених користувачем,
визначити можливість існування трикутника,складеного з цих відрізків.
Якщо такий трикутник існує, то визначити, чи є він різнобічним, рівнобедреним або рівностороннім."""

A = float(input('Введіть першу сторону трикутника: '))
B = float(input('Введіть другу сторону трикутника: '))
C = float(input('Введіть треттю сторону трикутника: '))

if A == 0 or B == 0 or C == 0:
    print('Введене невірне значення')
elif A + B <= C:
    print('Трикутник не існує')
elif A != B and A != C and B != C:
    print('Трикутник різнобічний')
elif A == B and B == C:
    print('Трикутник рівносторонній')
elif A == B or B == C or A == C:
    print('Трикутник рівнобедрений')
