"""17.Дано три цілих числа. Визначте, скільки серед них збігаються. Програма повинна вивести одне з чисел:
3 (якщо все збігаються), 2 (якщо два збігається) або 0 (якщо все числа різні)."""

a = float(input("Введите первое число: "))
b = float(input("Введите второе число: "))
c = float(input("Введите третье число: "))

if a == b and b == c:
    print('3(всі збігаються)')
elif a == b or b == c or a == c:
    print('2(два збігаються)')
else:
    print('0(всі числа різні)')
