"""Лабораторная работа 8
Толочный Виталий 141
Задача 6
Описати програму з використанням словника. Дано базу даних продажів
інтернет-магазину. Кожен рядок вхідних даних представляє запис виду:
Покупець, Товар, Кількість. Підрахуйте для кожного покупця кількість товарів
кожного виду. Прізвища покупців та назви товарів виводити в
лексикографічному порядку."""

dict0 = dict()

def InputDict():
    d1 = dict()
    d2 = dict()
    print("Введите значения в следующем порядке: Сумма Продукт Клиент: ")
    l1 = [i for i in input().split()]
    d2[l1[1]] = int(l1[2])
    d1[l1[0]] = d2
    
    if dict0.get(l1[0]) == None:
        dict0[l1[0]] = d2
    else:
        
        if dict0[l1[0]].get(l1[1]) == None:
            dict0[l1[0]].update(d2)
        else:
            dict0[l1[0]][l1[1]]=int(l1[2])+int(dict0[l1[0]][l1[1]])
            
def OutputOfDict(dict1):
    for key, value in dict1.items():
        print("Клиент: ",key,"Купленые продукты: ",value)
        
num = int(input("Введите количество: "))
for i in range(num):
    InputDict()           
OutputOfDict(dict0)
