"""4.Дано катети прямокутного трикутника a і b.
Знайти його гіпотенузу c і периметр P: c=(a2+b2
)1/2"""

a = int(input('Введите 1-й катет:'))
print('a' '=', a)
b = int(input('Введите 2-й катет:'))
print('b' '=', b)
c = ((a ** 2 + b ** 2) ** 0.5)
p = (a + b + c)
print('Катет с ', c)
print('Периметр', p)
