'''15. Дано координати (x; y) точки і радіус кола (r). Визначити чи належить дана точка колі, якщо його центр знаходиться на початку координат.'''
import math
R = float(input("Ведите радиус круга: "))
print("Введите координаты точки\n")
X = float(input("X: "))
Y = float(input("Y: "))

A = math.sqrt(pow(X, 2) + pow(Y, 2))

if A <= R:
    print("Точка принадлежит кругу...")
else:
    print("Точка не принадлежит кругу...")

'''
if(X <= R and Y <= R):
    print("Точка принадлежит кругу...")
else:
    print("Точка не принадлежит кругу...")
'''