'''11. Дано три змінні: X, Y, Z. Якщо їх значення впорядковані за спаданням, то подвоїти їх;
в іншому випадку замінити значення кожної змінної на протилежне.'''
X = int(input("Введите первое значение X: "))
Y = int(input("Введите второе значение Y: "))
Z = int(input("Введите третье значение Z: "))
if(X < Y and Y < Z):
    X *= 2
    Y *= 2
    Z *= 2
    print("Числа упорядочены по возрастанию. Изменённые значения: ", X, Y, Z)
else:
    X = -2 * X
    Y = -2 * Y
    Z = -2 * Z
    print("Изменённые значения: ", X, Y, Z)