# Дана сторона квадрата a. Знайти його периметр P=4·a.
# Гришан Богдан 141 група.

a = float(input("Введите длинну стороны квадрата: "))

P = 4 * a

print(" Периметр равен:" + str(P))
