# Швидкість першого автомобіля V1 км/год, другого - V2 км/год, відстань між ними S км.
# Визначити відстань між ними через T годин, якщо автомобілі спочатку рухаються назустріч один одному.
# Дана відстань рівна модулю різниці початкової відстані і загального шляху, пройденого автомобілями;
# загальний шлях = час · сумарна швидкість.
# Гришан Богдан 141 група.

speed1 = float(input("Введите скорость первого автомобиля (км/ч): "))
speed2 = float(input("Введите скорость второго  автомобиля (км/ч): "))
distance = float(input("Введите расстояние между автомобилями (в километрах): "))
time = float(input("Введите время(в часах): "))

distance2 = time * (speed1 + speed2)
finDistance = abs(distance - distance2)

print("Расстояние между автомобилями через " + str(time) + " часа(час/часов)становит: " + str(
    finDistance) + " километров ")
